package note.lym.org.noteproject.model.bean;

import org.litepal.crud.DataSupport;

import java.io.Serializable;
import java.util.List;

/**
 *
 * @author yaoming.li
 * @since 2017-05-11 23:02
 */
public class TextJoke extends DataSupport implements Serializable {

    /**
     * showapi_res_code : 0
     * showapi_res_error :
     * showapi_res_body : {"allPages":309,"ret_code":0,"contentlist":[{"id":"59141bc56e36d651f8c3831e","title":"今天打的，的哥开车速...","text":"今天打的，的哥开车速度很快，问完我目的地，打开计价器，也不说话，风驰电掣一般，坐在副驾驶座位上的我看得胆战心惊。前边到了一个路口，绿灯在不停闪烁，马上要变黄灯了，只见司机一个加速，赶在红灯闪亮之前冲了出去，我下意识地说了一句：\u201c我的天，太快了！\u201d的哥听完，淡定地回答了一句：\u201c哪有那么多的青春可以等待？\u201d哥啊，那有那么多生命供你飙车。。。","type":1,"ct":"2017-05-11 16:07:33.096"},{"id":"591412f96e36d651f8c35772","title":"男子很疑惑的说：\u201c为...","text":"男子很疑惑的说：\u201c为什么每次你骂我废物的时候，楼下的总是用竹竿敲他们家的天花板？\u201d\r\n老婆说：\u201c憨货，说你傻，你还不承认，人家那是在表示：顶楼上的。\u201d","type":1,"ct":"2017-05-11 15:30:01.181"},{"id":"59140d5d6e36d651f8c350b6","title":"一位夫人到画商那去，...","text":"一位夫人到画商那去，想买一幅人物画。她看到的都不满意，她对店里的售货员说：\u201c画家画上的女人为什么都没有穿衣服？\u201d\r\n售货员：\u201c这是为了避免衣服的样式以后过时了。\u201d","type":1,"ct":"2017-05-11 15:06:05.347"},{"id":"59140d5d6e36d651f8c350b0","title":"上课给学生板书的时候...","text":"上课给学生板书的时候没忍住放了个绵长的屁，回头一看正对我的男生发型被吹成了中分。","type":1,"ct":"2017-05-11 15:06:05.294"},{"id":"591400656e36d651f8c31f94","title":"刚才和老公xxoo快...","text":"刚才和老公xxoo快到高潮老公突然抽出，说了句，哈哈急死你Y的，然后穿衣服上班去了，留我一人在床上凌乱，这才结婚没俩月，这是搞什么！！ ","type":1,"ct":"2017-05-11 14:10:45.218"},{"id":"591400656e36d651f8c31f93","title":"妆也化好了，行李也装...","text":"妆也化好了，行李也装好了，站在家门口就等台风了，国庆长假难得啊，来一场说走就走的旅行。吹到哪就去哪，我好害怕，又好尴尬，万一别人都刮跑了，我刮不走怎么办，那多丢人！","type":1,"ct":"2017-05-11 14:10:45.215"},{"id":"591400656e36d651f8c31f8a","title":"她跑到我跟前，对我说...","text":"她跑到我跟前，对我说：＂喜欢我就要大声说出来啊！＂\r\n我张了张嘴，又看了她一眼，她冲我点了点头。\r\n我深吸了一口气，吼道：＂出来啊！＂","type":1,"ct":"2017-05-11 14:10:45.193"},{"id":"5913e3496e36d651f8c2bbd2","title":"我们当兵体检要检查小...","text":"我们当兵体检要检查小JJ。一哥们很害羞，轮到他时，军医说：\u201c脱掉内裤。\u201d\r\n他扭扭捏捏的脱光了，军医又说：\u201c放上来。\u201d\r\n这哥们满脸通红，咬紧牙关踮起脚好不容易把小JJ放桌子上。\r\n军医抬头一看，说：\u201c我靠，我说的是体检表。\u201d","type":1,"ct":"2017-05-11 12:06:33.548"},{"id":"5913e3496e36d651f8c2bbd1","title":"同事们刚在讨论《我们...","text":"同事们刚在讨论《我们结婚吧》这部电视剧，\r\n有人说高圆圆的演技不如黄海波，一男同事答，长得漂亮就行了，\r\n一部剧里总需要个花瓶吧。一女同事笑曰，难道柳岩不算花瓶？\r\n两秒后一男同事淡定的说了句，她顶多算个奶瓶。哈。。。","type":1,"ct":"2017-05-11 12:06:33.544"},{"id":"5913e3496e36d651f8c2bbd0","title":"昨晚煮螃蟹，水开后，...","text":"昨晚煮螃蟹，水开后，我把螃蟹一个个扔进锅里。\r\n蟹子很新鲜，在锅里乱动。\r\n老婆打小心善，就见不得这个，遂躲在我身后捂着眼睛不敢看。\r\n我宽慰道：老婆，我们是不是太残忍了？\r\n老婆：嗯\u2026\u2026放盐了吗？","type":1,"ct":"2017-05-11 12:06:33.380"},{"id":"5913e3496e36d651f8c2bbcd","title":"今天大清早儿就听到一...","text":"今天大清早儿就听到一个振奋人心的消息：西安交大一个美国的留学生期末考英语挂了\u2026\u2026竟然挂了\u2026","type":1,"ct":"2017-05-11 12:06:33.351"},{"id":"5913dab96e36d651f8c292bc","title":"晚上想去外面打游戏，...","text":"晚上想去外面打游戏，老爸死活都留不住我后向老妈求援，老妈从厨房摸出一把刀冷哼一声：\u201c留不住？我今天就给你表演一个刀下留人。\u201d","type":1,"ct":"2017-05-11 11:30:01.189"},{"id":"5913dab96e36d651f8c292bb","title":"一金店遭遇打劫，匪徒...","text":"一金店遭遇打劫，匪徒手持砍刀威胁一女店员往袋子里装金饰品。。。\r\n匪徒有些焦急大喊：\u201c猪呀！快点。。。\u201d\r\n正在这时，女店员突然拿起桌上计算器疯狂向匪徒头上砸去！这一连串猛砸，将匪徒击倒。。。大家一拥而上，把匪徒制服。。。\r\n当记者采访那名英勇的女店员时，她的情绪还没有稳定。。。记者：\u201c你能讲讲当时你是什么样的心里斗争，英勇的制服了匪徒。。。\u201d\r\n女店员气冲冲的说：\u201c为了生活，我可以忍！但谁说我胖！我就跟谁玩命！\u201d","type":1,"ct":"2017-05-11 11:30:01.189"},{"id":"5913ccac6e36d651f8c25f0c","title":"同学聚会，两个同学吵...","text":"同学聚会，两个同学吵起来，当年的班级大哥（现在没啥威信了）从兜里拿出来一把刀一下扎在桌子上，说谁在吵我弄死谁。从此以后大家都\u2026\u2026知道他陪了一张5000的桌子\u2026\u2026","type":1,"ct":"2017-05-11 10:30:04.076"},{"id":"5913c7e96e36d651f8c25959","title":"甲：\u201c足球比赛我看得...","text":"甲：\u201c足球比赛我看得多啦，我懂得关于足球的一切知识！！\u201d\r\n乙：\u201c是吗！！那你告诉我，足球网有多少窟窿眼。。。。。\u201d","type":1,"ct":"2017-05-11 10:09:45.060"},{"id":"5913b08c6e36d651f8c203c8","title":"和女友去散步，她突然...","text":"和女友去散步，她突然放了个闷屁（巨臭的那种），于是我看见介个二货迅速围着我转了一圈跑到我面前说:亲爱的，你已经被我的屁包围了，快投降吧哈哈！\r\n","type":1,"ct":"2017-05-11 08:30:04.260"},{"id":"5913b08c6e36d651f8c203c6","title":"女儿：\u201c妈妈妈妈，我...","text":"女儿：\u201c妈妈妈妈，我要告诉你件事。\u201d\r\n妈妈：\u201c什么事？\u201d\r\n女儿：\u201c那天我看到爸爸和刘阿姨在床上\u2026\u201d\r\n妈妈打断：\u201c等下，等你爸回来再当面说！\u201d\r\n爸爸回，妈妈：\u201c说吧\u201d！\r\n女儿：\u201c妈妈，那天我看到爸爸和刘阿姨在床上做你和王叔叔经常做的事\u2026\u201d\r\n爸妈妈：\u201c卧槽\u2026\u201d","type":1,"ct":"2017-05-11 08:30:04.239"},{"id":"5913a27a6e36d651f8c1c886","title":" 有次做手术，特别紧...","text":" 有次做手术，特别紧张。帅哥医生问我：\u201c别紧张，放首歌给你听吧？\u201d我心里各种感激啊！然后就听见：\u201c朋友你今天就要远走，干了这杯酒\u2026\u2026\u201d <br />","type":1,"ct":"2017-05-11 07:30:02.912"},{"id":"5912ca7e6e364f3894cac851","title":"苹果5的充电线坏了，...","text":"苹果5的充电线坏了，跑到苹果体验店\r\n非常装逼问，充电线多少钱，售货员说199\r\n次澳，对于我等屌丝来说好贵lz果断在体验店里一顿冲，然后走了\r\n深藏功与名忘不了售货员妹子的凌乱眼神啊！","type":1,"ct":"2017-05-10 16:08:30.191"},{"id":"5912ca7e6e364f3894cac84f","title":"亲戚家的小孩子去姥爷...","text":"亲戚家的小孩子去姥爷家串门。<br />姥爷让外孙亲自己脸蛋，亲了第一口姥爷说不响，再亲一口。<br />小孩又亲了第二口，姥爷还说不响。<br />小孩这次狠狠的一巴掌上去问：这回响不响？响不响？","type":1,"ct":"2017-05-10 16:08:30.189"}],"currentPage":1,"allNum":6170,"maxResult":20}
     */

    private int showapi_res_code;
    private String showapi_res_error;
    private ShowapiResBodyBean showapi_res_body;

    public int getShowapi_res_code() {
        return showapi_res_code;
    }

    public void setShowapi_res_code(int showapi_res_code) {
        this.showapi_res_code = showapi_res_code;
    }

    public String getShowapi_res_error() {
        return showapi_res_error;
    }

    public void setShowapi_res_error(String showapi_res_error) {
        this.showapi_res_error = showapi_res_error;
    }

    public ShowapiResBodyBean getShowapi_res_body() {
        return showapi_res_body;
    }

    public void setShowapi_res_body(ShowapiResBodyBean showapi_res_body) {
        this.showapi_res_body = showapi_res_body;
    }

    public static class ShowapiResBodyBean {
        /**
         * allPages : 309
         * ret_code : 0
         * contentlist : [{"id":"59141bc56e36d651f8c3831e","title":"今天打的，的哥开车速...","text":"今天打的，的哥开车速度很快，问完我目的地，打开计价器，也不说话，风驰电掣一般，坐在副驾驶座位上的我看得胆战心惊。前边到了一个路口，绿灯在不停闪烁，马上要变黄灯了，只见司机一个加速，赶在红灯闪亮之前冲了出去，我下意识地说了一句：\u201c我的天，太快了！\u201d的哥听完，淡定地回答了一句：\u201c哪有那么多的青春可以等待？\u201d哥啊，那有那么多生命供你飙车。。。","type":1,"ct":"2017-05-11 16:07:33.096"},{"id":"591412f96e36d651f8c35772","title":"男子很疑惑的说：\u201c为...","text":"男子很疑惑的说：\u201c为什么每次你骂我废物的时候，楼下的总是用竹竿敲他们家的天花板？\u201d\r\n老婆说：\u201c憨货，说你傻，你还不承认，人家那是在表示：顶楼上的。\u201d","type":1,"ct":"2017-05-11 15:30:01.181"},{"id":"59140d5d6e36d651f8c350b6","title":"一位夫人到画商那去，...","text":"一位夫人到画商那去，想买一幅人物画。她看到的都不满意，她对店里的售货员说：\u201c画家画上的女人为什么都没有穿衣服？\u201d\r\n售货员：\u201c这是为了避免衣服的样式以后过时了。\u201d","type":1,"ct":"2017-05-11 15:06:05.347"},{"id":"59140d5d6e36d651f8c350b0","title":"上课给学生板书的时候...","text":"上课给学生板书的时候没忍住放了个绵长的屁，回头一看正对我的男生发型被吹成了中分。","type":1,"ct":"2017-05-11 15:06:05.294"},{"id":"591400656e36d651f8c31f94","title":"刚才和老公xxoo快...","text":"刚才和老公xxoo快到高潮老公突然抽出，说了句，哈哈急死你Y的，然后穿衣服上班去了，留我一人在床上凌乱，这才结婚没俩月，这是搞什么！！ ","type":1,"ct":"2017-05-11 14:10:45.218"},{"id":"591400656e36d651f8c31f93","title":"妆也化好了，行李也装...","text":"妆也化好了，行李也装好了，站在家门口就等台风了，国庆长假难得啊，来一场说走就走的旅行。吹到哪就去哪，我好害怕，又好尴尬，万一别人都刮跑了，我刮不走怎么办，那多丢人！","type":1,"ct":"2017-05-11 14:10:45.215"},{"id":"591400656e36d651f8c31f8a","title":"她跑到我跟前，对我说...","text":"她跑到我跟前，对我说：＂喜欢我就要大声说出来啊！＂\r\n我张了张嘴，又看了她一眼，她冲我点了点头。\r\n我深吸了一口气，吼道：＂出来啊！＂","type":1,"ct":"2017-05-11 14:10:45.193"},{"id":"5913e3496e36d651f8c2bbd2","title":"我们当兵体检要检查小...","text":"我们当兵体检要检查小JJ。一哥们很害羞，轮到他时，军医说：\u201c脱掉内裤。\u201d\r\n他扭扭捏捏的脱光了，军医又说：\u201c放上来。\u201d\r\n这哥们满脸通红，咬紧牙关踮起脚好不容易把小JJ放桌子上。\r\n军医抬头一看，说：\u201c我靠，我说的是体检表。\u201d","type":1,"ct":"2017-05-11 12:06:33.548"},{"id":"5913e3496e36d651f8c2bbd1","title":"同事们刚在讨论《我们...","text":"同事们刚在讨论《我们结婚吧》这部电视剧，\r\n有人说高圆圆的演技不如黄海波，一男同事答，长得漂亮就行了，\r\n一部剧里总需要个花瓶吧。一女同事笑曰，难道柳岩不算花瓶？\r\n两秒后一男同事淡定的说了句，她顶多算个奶瓶。哈。。。","type":1,"ct":"2017-05-11 12:06:33.544"},{"id":"5913e3496e36d651f8c2bbd0","title":"昨晚煮螃蟹，水开后，...","text":"昨晚煮螃蟹，水开后，我把螃蟹一个个扔进锅里。\r\n蟹子很新鲜，在锅里乱动。\r\n老婆打小心善，就见不得这个，遂躲在我身后捂着眼睛不敢看。\r\n我宽慰道：老婆，我们是不是太残忍了？\r\n老婆：嗯\u2026\u2026放盐了吗？","type":1,"ct":"2017-05-11 12:06:33.380"},{"id":"5913e3496e36d651f8c2bbcd","title":"今天大清早儿就听到一...","text":"今天大清早儿就听到一个振奋人心的消息：西安交大一个美国的留学生期末考英语挂了\u2026\u2026竟然挂了\u2026","type":1,"ct":"2017-05-11 12:06:33.351"},{"id":"5913dab96e36d651f8c292bc","title":"晚上想去外面打游戏，...","text":"晚上想去外面打游戏，老爸死活都留不住我后向老妈求援，老妈从厨房摸出一把刀冷哼一声：\u201c留不住？我今天就给你表演一个刀下留人。\u201d","type":1,"ct":"2017-05-11 11:30:01.189"},{"id":"5913dab96e36d651f8c292bb","title":"一金店遭遇打劫，匪徒...","text":"一金店遭遇打劫，匪徒手持砍刀威胁一女店员往袋子里装金饰品。。。\r\n匪徒有些焦急大喊：\u201c猪呀！快点。。。\u201d\r\n正在这时，女店员突然拿起桌上计算器疯狂向匪徒头上砸去！这一连串猛砸，将匪徒击倒。。。大家一拥而上，把匪徒制服。。。\r\n当记者采访那名英勇的女店员时，她的情绪还没有稳定。。。记者：\u201c你能讲讲当时你是什么样的心里斗争，英勇的制服了匪徒。。。\u201d\r\n女店员气冲冲的说：\u201c为了生活，我可以忍！但谁说我胖！我就跟谁玩命！\u201d","type":1,"ct":"2017-05-11 11:30:01.189"},{"id":"5913ccac6e36d651f8c25f0c","title":"同学聚会，两个同学吵...","text":"同学聚会，两个同学吵起来，当年的班级大哥（现在没啥威信了）从兜里拿出来一把刀一下扎在桌子上，说谁在吵我弄死谁。从此以后大家都\u2026\u2026知道他陪了一张5000的桌子\u2026\u2026","type":1,"ct":"2017-05-11 10:30:04.076"},{"id":"5913c7e96e36d651f8c25959","title":"甲：\u201c足球比赛我看得...","text":"甲：\u201c足球比赛我看得多啦，我懂得关于足球的一切知识！！\u201d\r\n乙：\u201c是吗！！那你告诉我，足球网有多少窟窿眼。。。。。\u201d","type":1,"ct":"2017-05-11 10:09:45.060"},{"id":"5913b08c6e36d651f8c203c8","title":"和女友去散步，她突然...","text":"和女友去散步，她突然放了个闷屁（巨臭的那种），于是我看见介个二货迅速围着我转了一圈跑到我面前说:亲爱的，你已经被我的屁包围了，快投降吧哈哈！\r\n","type":1,"ct":"2017-05-11 08:30:04.260"},{"id":"5913b08c6e36d651f8c203c6","title":"女儿：\u201c妈妈妈妈，我...","text":"女儿：\u201c妈妈妈妈，我要告诉你件事。\u201d\r\n妈妈：\u201c什么事？\u201d\r\n女儿：\u201c那天我看到爸爸和刘阿姨在床上\u2026\u201d\r\n妈妈打断：\u201c等下，等你爸回来再当面说！\u201d\r\n爸爸回，妈妈：\u201c说吧\u201d！\r\n女儿：\u201c妈妈，那天我看到爸爸和刘阿姨在床上做你和王叔叔经常做的事\u2026\u201d\r\n爸妈妈：\u201c卧槽\u2026\u201d","type":1,"ct":"2017-05-11 08:30:04.239"},{"id":"5913a27a6e36d651f8c1c886","title":" 有次做手术，特别紧...","text":" 有次做手术，特别紧张。帅哥医生问我：\u201c别紧张，放首歌给你听吧？\u201d我心里各种感激啊！然后就听见：\u201c朋友你今天就要远走，干了这杯酒\u2026\u2026\u201d <br />","type":1,"ct":"2017-05-11 07:30:02.912"},{"id":"5912ca7e6e364f3894cac851","title":"苹果5的充电线坏了，...","text":"苹果5的充电线坏了，跑到苹果体验店\r\n非常装逼问，充电线多少钱，售货员说199\r\n次澳，对于我等屌丝来说好贵lz果断在体验店里一顿冲，然后走了\r\n深藏功与名忘不了售货员妹子的凌乱眼神啊！","type":1,"ct":"2017-05-10 16:08:30.191"},{"id":"5912ca7e6e364f3894cac84f","title":"亲戚家的小孩子去姥爷...","text":"亲戚家的小孩子去姥爷家串门。<br />姥爷让外孙亲自己脸蛋，亲了第一口姥爷说不响，再亲一口。<br />小孩又亲了第二口，姥爷还说不响。<br />小孩这次狠狠的一巴掌上去问：这回响不响？响不响？","type":1,"ct":"2017-05-10 16:08:30.189"}]
         * currentPage : 1
         * allNum : 6170
         * maxResult : 20
         */

        private int allPages;
        private int ret_code;
        private int currentPage;
        private int allNum;
        private int maxResult;
        private List<ContentlistBean> contentlist;

        public int getAllPages() {
            return allPages;
        }

        public void setAllPages(int allPages) {
            this.allPages = allPages;
        }

        public int getRet_code() {
            return ret_code;
        }

        public void setRet_code(int ret_code) {
            this.ret_code = ret_code;
        }

        public int getCurrentPage() {
            return currentPage;
        }

        public void setCurrentPage(int currentPage) {
            this.currentPage = currentPage;
        }

        public int getAllNum() {
            return allNum;
        }

        public void setAllNum(int allNum) {
            this.allNum = allNum;
        }

        public int getMaxResult() {
            return maxResult;
        }

        public void setMaxResult(int maxResult) {
            this.maxResult = maxResult;
        }

        public List<ContentlistBean> getContentlist() {
            return contentlist;
        }

        public void setContentlist(List<ContentlistBean> contentlist) {
            this.contentlist = contentlist;
        }

        public static class ContentlistBean {
            /**
             * id : 59141bc56e36d651f8c3831e
             * title : 今天打的，的哥开车速...
             * text : 今天打的，的哥开车速度很快，问完我目的地，打开计价器，也不说话，风驰电掣一般，坐在副驾驶座位上的我看得胆战心惊。前边到了一个路口，绿灯在不停闪烁，马上要变黄灯了，只见司机一个加速，赶在红灯闪亮之前冲了出去，我下意识地说了一句：“我的天，太快了！”的哥听完，淡定地回答了一句：“哪有那么多的青春可以等待？”哥啊，那有那么多生命供你飙车。。。
             * type : 1
             * ct : 2017-05-11 16:07:33.096
             */

            private String id;
            private String title;
            private String text;
            private int type;
            private String ct;

            public String getId() {
                return id;
            }

            public void setId(String id) {
                this.id = id;
            }

            public String getTitle() {
                return title;
            }

            public void setTitle(String title) {
                this.title = title;
            }

            public String getText() {
                return text;
            }

            public void setText(String text) {
                this.text = text;
            }

            public int getType() {
                return type;
            }

            public void setType(int type) {
                this.type = type;
            }

            public String getCt() {
                return ct;
            }

            public void setCt(String ct) {
                this.ct = ct;
            }
        }
    }
}
